Reports/Баланс3.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Report>
		<Properties>
			<Name>Баланс3</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ЛимитыОвердрафта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ЛимитыОвердрафта</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>сумма в валюте кошелька</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрогноз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрогнозРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>флВнутреннее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыДолга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мне</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/Баланс3/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетСервер();
	
КонецПроцедуры

&НаСервере
Функция СформироватьЧастьОтчета(Макет, ЗаголовокРаздела, Итого, ТекстЗапроса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Если ЗначениеЗаполнено(ДатаБаланса) Тогда
		Запрос.УстановитьПараметр("ДатаБаланса", КонецДня(ДатаБаланса));
	Иначе		
		Запрос.УстановитьПараметр("ДатаБаланса", КонецДня(ТекущаяДата()));
	КонецЕсли;
		
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Область = Макет.ПолучитьОбласть("РазделЗагол");
	Область.Параметры.ЗаголовокРаздела = ЗаголовокРаздела;
	Область.Параметры.Сумма = ТЗ.Итог("СуммаОстаток");
	Результат.Вывести(Область);
	Итого = Итого + ТЗ.Итог("СуммаОстаток");
	
	Результат.НачатьГруппуСтрок("А1",Ложь);
	Для каждого Стр Из ТЗ Цикл
		Область = Макет.ПолучитьОбласть("РазделДетал");
		Область.Параметры.Детализация = Стр.Детализация;
		Область.Параметры.Сумма = Стр.СуммаОстаток;
		Результат.Вывести(Область);
	КонецЦикла;
	Результат.ЗакончитьГруппуСтрок();	
КонецФункции


&НаСервере
Функция СформироватьОтчетСервер()
	
	Результат.Очистить();
	
	Макет = Отчеты.Баланс2.ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка");
	Результат.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заголовок = "АКТИВ";
	Результат.Вывести(Область);
	
	ИтогоАктив = 0;
	
	//1. Собственные средствва
	ТекстЗапроса =  
	"ВЫБРАТЬ
	|	лимиты.Кошелек,
	|	лимиты.Лимит
	|ПОМЕСТИТЬ ВТлимиты
	|ИЗ
	|	РегистрСведений.ЛимитыОвердрафта.СрезПоследних(&ДатаБаланса, ) КАК лимиты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.Кошелек,
	|	ДенежныеСредстваОстатки.СуммаРеглОстаток
	|ПОМЕСТИТЬ ВТКредиты
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&ДатаБаланса, Кошелек.КредитнаяКарта) КАК ДенежныеСредстваОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХХХ.Кошелек,
	|	СУММА(ХХХ.СуммаРеглОстаток) КАК СуммаРеглОстаток
	|ПОМЕСТИТЬ ВТСобственные
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТКредиты.Кошелек КАК Кошелек,
	|		ВТКредиты.СуммаРеглОстаток КАК СуммаРеглОстаток
	|	ИЗ
	|		ВТКредиты КАК ВТКредиты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТлимиты.Кошелек,
	|		-ВТлимиты.Лимит
	|	ИЗ
	|		ВТлимиты КАК ВТлимиты) КАК ХХХ
	|
	|СГРУППИРОВАТЬ ПО
	|	ХХХ.Кошелек
	|
	|ИМЕЮЩИЕ
	|	СУММА(ХХХ.СуммаРеглОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.Кошелек КАК Детализация,
	|	ДенежныеСредстваОстатки.СуммаРеглОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(
	|			&ДатаБаланса,
	|			НЕ Кошелек.КредитнаяКарта
	|				И Кошелек.РасчетОстатковБюджет) КАК ДенежныеСредстваОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСобственные.Кошелек,
	|	ВТСобственные.СуммаРеглОстаток
	|ИЗ
	|	ВТСобственные КАК ВТСобственные";
	
	СформироватьЧастьОтчета(Макет, "Собственные средства", ИтогоАктив, ТекстЗапроса);
		
	//2. займы выданные
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Рег.СуммаРеглОстаток КАК СуммаОстаток,
	               |	Рег.Контрагент КАК Детализация
	               |ИЗ
	               |	РегистрНакопления.Долги.Остатки(&ДатаБаланса, ВидДолга = ЗНАЧЕНИЕ(Перечисление.ВидыДолга.Мне)) КАК Рег";
				   
	СформироватьЧастьОтчета(Макет, "Займы выданные", ИтогоАктив, ТекстЗапроса);

	//3. сбережения
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Рег.СуммаРеглОстаток КАК СуммаОстаток,
	               |	Рег.Кошелек КАК Детализация
	               |ИЗ
	               |	РегистрНакопления.Сбережения.Остатки(&ДатаБаланса) КАК Рег";
	СформироватьЧастьОтчета(Макет, "Сбережения", ИтогоАктив, ТекстЗапроса);
		
	
	//конец активов		
	Область = Макет.ПолучитьОбласть("Итого");
	Область.Параметры.Сумма = ИтогоАктив;
	Результат.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Пробел");
	Результат.Вывести(Область);
	
	
	//ПАССИВ
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заголовок = "ПАССИВ";
	Результат.Вывести(Область);

	ИтогоПассив = 0;
	
	//1. Займы полученные
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Рег.СуммаОстаток КАК СуммаОстаток,
	               |	Рег.Контрагент КАК Детализация
	               |ИЗ
	               |	РегистрНакопления.Долги.Остатки(&ДатаБаланса, ВидДолга = ЗНАЧЕНИЕ(Перечисление.ВидыДолга.Мой)) КАК Рег";
		
	СформироватьЧастьОтчета(Макет, "Займы полученные", ИтогоПассив, ТекстЗапроса);
	
	//2. Кредиты полученные (в кредитных организациях)
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Рег.СуммаОстаток КАК СуммаОстаток,
		|	Рег.Кошелек КАК Детализация
		|ИЗ
		|	РегистрНакопления.Кредиты.Остатки(&ДатаБаланса) КАК Рег";
		
	СформироватьЧастьОтчета(Макет, "Кредиты полученные", ИтогоПассив, ТекстЗапроса);
	
	//конец пассивов
	
	Область = Макет.ПолучитьОбласть("Итого");
	Область.Параметры.Сумма = ИтогоПассив;
	Результат.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Пробел");
	Результат.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Баланс");
	Область.Параметры.Сумма = ИтогоАктив - ИтогоПассив;
	Результат.Вывести(Область);
	
	//Таб.ТолькоПросмотр = Истина;
	Возврат 0;

КонецФункции
